{"joblist": [{"link": "https://www.indeed.com.sg/rc/clk?jk=052fcfe199d5296b&fccid=a5b4499d9e91a5c6&vjs=3", "job_title": "Operations Specialist, Google People Services", "company": "Google", "location": "Singapore", "summary": "Minimum qualifications:\nBachelor's degree in mathematics, economics, statistics, finance or another field that uses quantitative analysis, or equivalent practical experience.\n\nExperience contributing to project plans, collaborating on projects involving multiple teams and managing ongoing relationships with partners, or in process design and improvement.\n\nPreferred qualifications:\nExperience in measurements and analytics suggesting user-focused improvements, and navigating/influencing cross-functional teams to drive changes.\n\nExperience working in the immigration and/or employee mobility space.\n\nAbility to work creatively and adapt to change.\n\nDemonstrated attention to detail with excellent time-management skills.\n\nExcellent relationship management skills.\nAbout the job\nThe Google People Services, Operations function is the services and program management group within People Operations that makes HR stuff easy and intuitive for Googlers. Our global team optimizes people processes, from problem definition to execution. We partner with teams across People Operations and in engineering to bring innovation and technology to the way we attract, retain and grow Googlers worldwide. We focus on providing an amazing experience to past, present and future Googlers, and work in Google’s fast-paced environment to deliver 100+ operational services, manage the contingent workforce and implement HR programs across 70+ countries. Regardless of location or level of experience, members of the Operations team have the opportunity to create, develop and implement some of the most complex global operations around the world.\n\nAs an Operations Specialist, you'll manage one or more Google People Services processes and will be responsible for operating them reliably, while also looking for continuous improvements. You will perform core work (e.g. enquiry response, data entry and reporting, data audits, etc), problem solve for special cases, manage initiatives to improve existing processes/systems and roll out new processes.\n\nThis position provides an excellent opportunity to get a broad overview of People Operations at Google. You will have the opportunity to learn about a variety of People Operations processes and to interact with stakeholders in different teams within APAC and globally. In addition, you will acquire skills in the areas of project/program management, process improvement, metrics and measurements, and vendor management.\nGreat just isn't good enough for our People Operations team (you probably know us better as \"\u0098Human Resources\"). Made up of equal parts HR professionals, former consultants and analysts, we're the advocates of Google's colorful culture. In People Ops, we \"find them, grow them, and keep them\"\u009d - we bring the world's most innovative people to Google and provide the programs that help them thrive. Whether recruiting the next great Googler, refining our core programs, developing talent or simply looking for ways to inject some more fun into the lives of our Googlers, we bring a data-driven approach that is reinventing the human resources field. Responsibilities\n\nManage Google People Services processes and assume responsibility for operating reliably, and for continuous improvements.\n\nImprove processes, including identification of challenges and opportunities for enhancement of process parameters.\n\nOperate a process of highly-reliable data entry around employee information, customer-friendly resolution of user enquiries, questions and challenges.\n\nDefine, collect and analyze process metrics.\nAt Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by emailing candidateaccommodations@google.com ."}, {"link": "https://www.indeed.com.sg/pagead/clk?mo=r&ad=-6NYlbfkN0AJdW9HPO5Yvb8ImRAvL--q9gQz1J8yLEwsJaA3s-6KO5L3mgcIFKXr_Qi7bPZ0N9-vVTI9NhgSkxRXnW8QfqTuF5QHrjAAPIcjJDn0BNTEGGOxk4WCj8aV0XWzqkx8r4EjjvhxPVw-a0OdmAwMY0iFejRvunzjzZnsn0HUMuDLVT7x92ge3x1YzLM-9BfiatoD9nWmPjZvDEE5jHBKl2vg2gZJVEyA-dJ6xz3dcSaWy0az6KB1Th_kv-Lw8t2SlAR3t7t8ckbB9FZL7rYDfK91VywwriAkqcp8IcgeGmUJNMQLT7zvuT8mCNtmV4sfJa8C0LhtqHAIWyVjUboJjktjynl2eV1tcP6PeoPBijDq23wt4oWS-PAs5MR0bFnBAWeMfzclsj28WB1Tra_AMiyp6vRn8pehV86GaIcBW9m3VpUCCOOwDq6nZRNK054skSA=&vjs=3&p=1&sk=&fvj=1", "job_title": "Team Leader - Lifestyle Concierge", "company": "John Paul - LC CONCIERGE Singapore Pte Ltd", "location": "Singapore", "summary": "$3,600 - $4,000 a monthABOUT JOHN PAULJohn Paul is the premier digitally-enabled global concierge service, providing brands with customized loyalty solutions.We thrive in challenging the status quo of transactional loyalty programs, driving long-term customer and employee engagement through an elegant combination of genuine human interaction and AI-driven CRM. Our customized relationship and membership strategies enable brands to interact with their customers and employees on an experiential and emotional level, creating a virtuous circle of deeper customer insight, higher quality customer service and increased customer lifetime value.John Paul was established in Paris in 2008 and has enjoyed consistent growth every year since its debut, including the acquisition of US-based LesConcierges in 2015. With over 1,000 employees across 5 continents, John Paul Group is a major player in the loyalty market, offering white-label services to some of the biggest brands across the financial services, luxury, travel, hospitality, technology and automotive industries. John Paul joined the AccorHotels group in 2016 and is now focusing on its next phase of growth, a key part of which is to expand its presence in APAC.Job DescriptionManage a team of customer service advisors, and provide training and coaching to inspire excellent customer service and high levels of engagement and productivity across a 24/7 rostered shift work environmentPro-actively investigate and implement improvements to increase customer satisfaction and productivity.Monitor operational activity and ensure client service level agreements are maintained and achievedEstablishing and exercising the necessary controls to ensure all activities performed are compliant with company policies and procedures.Required Experience, Skills and QualificationsPreference will be given to citizen of Singapore or permanent resident of Singapore.Must be available immediatelyMinimum 3 years' experience as a team leader with proven leadership skillsExcellent interpersonal and communication skills in order to interact in a successful manner with a variety of stakeholdersStrong problem solving and decision-making skills, be proactive and a good team leaderHigh attention to detail with good organisational skills and respect for deadlinesAbility to work autonomouslyFluent spoken and written EnglishRelated experience within the retail or luxury travel industry, with a large hospitality chain or luxury brand is a plus.Previous experience working with VIP clientele is an advantage.Familiarity with the luxury market, either professionally or through personal experience.Understands and is able to book all travel components including but not limited to airfare, accommodation and transportation is desirable.Excellent organizational skills, demonstrates high attention to detail.Synthesizes complex or diverse information, proficient in collecting and researching information, uses intuition and experience to complement information.ContinueIdentifies and resolves problems in a timely manner, gathers and analyses information skillfully, work well independently & in group problem solving situations.Job Type: Full-timeSalary: $3,600.00 to $4,000.00 /monthExperience:Customer Service: 3 years (Required)Education:Professional Qualification or Polytechnic Diploma (Required)Location:Singapore (Required)Language:Mandarin (Preferred)English (Required)Bahasa Malay (Preferred)"}, {"link": "https://www.indeed.com.sg/company/Education-Centre/jobs/Contract-efd5505f65984613?fccid=29d5f87a495c33f9&vjs=3", "job_title": "Contract / Permanent Part Time Tutor Needed ( islandwide )", "company": "Education Centre", "location": "Singapore", "summary": "$15 - $35 an hourPart-time, Contract, PermanentStag Match has built a reliable education system that fulfills the ever-growing needs for education center as well as tuition in Singapore.And we are now seeking Passionate Teachers who are looking to make a difference in the young minds.We are looking Contract / Permanent Part Time Teachers / Experienced Tutors / NIEs / ExSchool Teacher for Group Tuition in 2019East Area - Bedok / Simei / Tampines / Katong etc.North Area - Bukit Panjang / Woodlands / Hougang / SengkangCentre Area - Tiong BahruRequirements: - Experience in teaching Primary or Secondary Students- Able to teach English / Maths / Science / Chinese / Creative WritingKey Responsibilities: Deliver lesson plans in accordance with standard academic curriculumEngage students to create interest in the subjects taught by utilizing the highest quality of teaching methodsEnsure a conducing environment for studentsMonitor progress of students for coaching and feedback purposesFoster good and sincere relationship with parents and studentSkills and Experience Required: Possess recognized teaching qualification with at least 1 year of group teaching experience or private tutoringExcellent communication skillsPatient and genuinely takes interest in the welfare of studentsOnly Singaporean may applyWe thank all applicants for your interest and regret that only shortlisted applicants will be notified.Do send in your CV and state your prefer location, subjects and expected salaryContract - $15 to $35Part Time - $15 to $25Job Types: Part-time, Contract, PermanentSalary: $15.00 to $35.00 /hourExperience:teaching: 1 year (Preferred)Location:Singapore (Required)"}, {"link": "https://www.indeed.com.sg/pagead/clk?mo=r&ad=-6NYlbfkN0BaPp38t20B8eBR1eUUxGBgPftS685gzY1WJUba2a5u2tLj7uQVSvnURylbdRz_xb_RcvkXQM3kZkmieCqD3Kpdr542LZaDkkdSoe6CGVFXPPxu1hYQYu5GdXZFD6Wf7CnysM9CLDm8QLMLgse4fTwTlBzfhuQrpOe5JdAEFur6Lwiefd8PQzcKEDrJxssK_RgqxS7f4twd-pZgxcfnmB8Enak1i-Bzi03Uj2oCFBCa_HRiJsCdz4l0pYw3rnW0mFlwizUTFRaZSNi_tS35pP4MF4hh3eWcoXNOVcwDhpI-D4IQRK9JHzLD94JuItOXx6rLHlcz9s8KjNHzWKssjlWDZ_no5E22Fol-uhDi5InuUPzXQrqrxkC2D5ybblaYHlJgD46Q8OXn9Ua_8svq4ixkjT3kBmsOc1BDN50L0j6y0wKF_V7iC3Myf4TIhYJjpyMOYJJIKMrV0ceizGM7pbP3EB20GreJUvU=&vjs=3&p=1&sk=&fvj=0", "job_title": "PLANNER (TOKYO)", "company": "Amida Recruit", "location": "Singapore", "summary": "PermanentA leading project and construction advisory firm is now seeking an experienced Planner to provide schedule and planning services for a Greenfield Data Centre in Japan. This is a challenging and exciting opportunity to independently take control of a highly technical project. The role is full time based in Tokyo, Japan.\n\nKey Roles & Responsibilities:\n\nMonitor project progress closely and highlight potential issues to project team\nIdentifying mitigating measures\nLiaise with construction project team and the Client to establish project timeline, work plan, critical activities, progress S-Curve, resource loading and leveling plan.\nOrganise and assess completion of project on schedule by reviewing contractor's schedule.\nControl project plan by reviewing design, specifications, and plan and schedule changes; recommending action to the Client.\nWork closely with Contractors and Clients and update project schedule by collecting and analyzing information and live construction trends.\nRequirements:\n\nMinimum Degree in Engineering or a relevant discipline.\n10 years experience in planning/scheduling on large scale projects; candidates with proven success of delivering projects in Data Centres, Industrial or Hi Tech facilities will be preferred.\nPrior experience of working with main contractors as a Planner/Scheduler in Japan.\nProficient in various planning softwares. Primavera P6 is required for this position.\nExcellent communication skills\nEffectively bilingual - English and Japanese is required as the role requires communicating and managing stakeholders in both languages.\nThis opportunity is highly rewarding in terms of its professional exposure in an exciting market. Apply today and send your CV to cheryl.lee@amida-recruit.com\n\nEA No. 14C6959\n\nReg No. R1219598\nReference Number: CLE349_154754579132815\n\nConsultant: Cheryl Lee\nEmail: property.asia@amida-recruit.com\nPhone: +65 6922 0620\nEA: R 1219598"}, {"link": "https://www.indeed.com.sg/pagead/clk?mo=r&ad=-6NYlbfkN0BaPp38t20B8eBR1eUUxGBgPftS685gzY1WJUba2a5u2tLj7uQVSvnURylbdRz_xb_RcvkXQM3kZgLznZbixzttV31OveYW9LRqCSV0HvoKRMcQtXQm0xnYH1S-HwPhoGZxLVr3F1HOJ2JOojwQKbLGTO1Tu2KmUxwIt3DDUnaoJR0Gy5c1BWG9BfR5GFcQU9LRiISgfz4UYY9hFZdR7Da8FYovCmnPjn4v3iTEN3zp5wfjUs-EIEZUCTLI52KJmeep4juYxOW2DlsiVcGLmXOrghz5UC56jsHsh80YEPxJuAjDEcXrQhuhKYSnKCwUafSUFKLyhpQeZ22lSTqz7gSNwrCV0G5NcK2ItXKpF-UVt5yLXjePKkJ0PfQ1SETaMIIY0a6FWRGmdwGtSPwy_fGlpK3lu40wdO4CjQClIGwAVe6kyMAVSQcjTKk-KqS4ihaG1T9-kNEI11GiQM3VTbeN6PDe1IUxrLlJeq4tw8W6Uw==&vjs=3&p=1&sk=&fvj=0", "job_title": "PROJECT DIRECTOR (TOKYO)", "company": "Amida Recruit", "location": "Singapore", "summary": "PermanentA leading project and construction advisory firm is now seeking a Project Director to lead a Greenfield Data Centre project in Tokyo, Japan. This is a highly challenging and exciting opportunity to work with a global client on a multi million project.\n\nAs a Project Director, you will provide strategic advice to the Client at the project conception stage, including delivery model, procurement strategy, selection of main contractors and contract negotiations. You will be adopting project management methodologies in order to successfully achieve client's objectives which includes time, cost and quality parameters. You will establish effective project governance, processes, templates and systems to be utilized throughout the project. You will take a lead position in interacting with the client and other consultants at all project stages.\nThe ideal candidate should meet the following requirements,\n\nRecognised Degree in Engineering (Civil, Mechanical or Electrical).\nA minimum of 20 years working experience in Japan with a successful track record of delivering projects in data centres or hi tech sectors.\nLeadership position for the past 5 years.\nStrong ability to manage clients, contractors and other vendors; a mix of consultancy and contractor experience will be highly advantageous.\nCandidates with the ability to work independently in a diverse working environment will be highly sought after.\nRole is based full time in Tokyo, Japan.\nCandidates have to be effectively bilingual in both English and Japanese as the role requires communicating and managing stakeholders in both languages.\nDon't miss out on this exciting opportunity today. Send your CV to Cheryl.lee@amida-recruit.com\n\nEA No. 14C6959\n\nReg No. R1219598\nReference Number: CLE351_154754639367170\n\nConsultant: Cheryl Lee\nEmail: property.asia@amida-recruit.com\nPhone: +65 6922 0620\nEA: R 1219598"}, {"link": "https://www.indeed.com.sg/pagead/clk?mo=r&ad=-6NYlbfkN0CMugugEJy7r35H7gIRIbSOpSs627YEsfBYUjUt94_KOzqmCEUXE7mfmS4JvDMTiqZ069k7-yW_vHoyyEq9PgkufINzxel5oc4yBaYlacmXiMvMxfCIA-wWn8ssLWXVeY2FU4suZsTOWrBNDq4CaUmPN5k182Q6xKGPzgrWAG-q6fTze0331dtPhrsC0JOKyynh3v_MWRQWXLSx-RRtfM5f1nR-c-Dadb1byZdojQhR_5-IBbbwBXOdjBUXv5DCt8FBj8AgGIPJsphEAFWPwpJPhoj3MPQESaBLHl1BAiXky68zT0SinTf4lzNOgBTbCEnVvf5yShtzOq-IXkJi4q5p0LA8627fkpKRc_DVim7XeudInAVfMySEHW0GgC0x3zykXQzydMqK_Chtyqpr4WPpe8p2X2Jaa3M4H404Q1TbQ1VQho-k9m_H8iCqhE6qQgDhrSVnF-UwHtz_fBJ1CH1Fvz5xsyrwm-5cB1f-hI7eRBm0NwQHWDA3_c5c0sjHJy6ux2K3Icwhxm0HHKBOTmqafGxR0tJ_TGbedPfybrheUXmebIQr9pmls7F89x_Ufwhx7-YFyBg0iBJbWHUhdYSmidnfyUK_gUIpE-pIzxi1-Y_x1meMLT32TtLnWneEHbiD1X5fODCpOyX6ps2tTGmx4ripcDmgpInB7e46vWP0FUBN_y-Na0SwuJugzGjkxD-1LWRrXwWPDLgAcB9ahNb7&vjs=3&p=1&sk=&fvj=0", "job_title": "EDE (SG) - Intern", "company": "Seagate Singapore International Headquarter Pte Ltd", "location": "Singapore", "summary": "Internship190030 EDE (SG) - Intern (Open)\n\nAbout the Role You will:\nSupport on CAD Data Migration between old and new server\nSupport on CAD and BOM Data correction/update\nSupport on mapping EPDM data to Seascape\nSupport on Engineering Change Order process\nAbout Our Group\nEDE provides total engineering solution and support to Operation and R&D; division in the organisation\nthrough prototyping, equipment efficiency optimization and mass production activities.\nAbout You\nPreferable with experience of using CAD software i.e. Solidworks, Pro-E, AutoCad etc\nFamiliar with Microsoft Office (Word/PowerPoint/Excel)\nKnowledge in Mechanical Design Life Cycle or Engineering process\nKnowledge in Geometrical Dimension & Tolerance and Product Data Management is a plus\nSelf-motivated, independent and a team player with strong analytical skills\nBachelor or Masters student and/or equivalent experience\nAny Requirements: Enter Clean Room etcJob Family: Operations Support\n\n190030 EDE (SG) - Intern (Open)About the Role You will: * Support on CAD Data Migration between old and new server * Support on CAD and BOM Data correction/update * Support on mapping EPDM data to Seascape * Support on Engineering Change"}, {"link": "https://www.indeed.com.sg/pagead/clk?mo=r&ad=-6NYlbfkN0CMugugEJy7r35H7gIRIbSOpSs627YEsfBYUjUt94_KOzqmCEUXE7mfmS4JvDMTiqZ069k7-yW_vHoyyEq9PgkufINzxel5oc4yBaYlacmXiMvMxfCIA-wWn8ssLWXVeY2FU4suZsTOWrBNDq4CaUmP48dpHQDZ6D1NyL83WNOTf9b-n9UBXdhrsVFrV11ki2BlNa304HfS1WWt-eyeNkctHV-8Zp-Lhx3qNwRU_P08S9fpKyKl60bVrtOykYuS66wf0JC0ECo4xopWlR7WecKhAgQtc4VdmBf72AosqaAtNHY02XEk1U4o2XvJAvjkxYkXx77LYK0XxIPYZJ2iFRZNCvfkiBQqQJahJhEe33yh1-Pm5JoywIVTRWVd_VoDs32fbSd57oaKIDfZqi1gQWXRtsx2Ei1y_w4aV8HzcmTrba3lCfwWaZKSTP8ZIvO4Obvdi-VzjdIO2FKFGSI2JoIojuh4AhPZZoDn6_zVbRj7QyZZAL1uvecty6TkahVqmw8p2QHtevJA2uA1m1X9P6xAM4WkdJ9OmFaMliI7h7zF-RUDhFCOFWepf7NkIxcRl48ddH9dNhVh88WNGslA4O_p14Z3-s8MAysLztv780m74_-9pHCJta2BQUuyY2EAYA0Y37N5gyIQfRj2gI_8IZ20pXE9VpSrqPCDsv00lYLWtmRaRcXDBuHL8BKYb8YIMIeOTWKQogoEjNU8Ri5svYwp&vjs=3&p=1&sk=&fvj=0", "job_title": "EDE (SG) - Intern", "company": "Seagate Singapore International Headquarter Pte Ltd", "location": "Singapore", "summary": "Internship190030 EDE (SG) - Intern (Open)\n\nAbout the Role You will:\nSupport on CAD Data Migration between old and new server\nSupport on CAD and BOM Data correction/update\nSupport on mapping EPDM data to Seascape\nSupport on Engineering Change Order process\nAbout Our Group\nEDE provides total engineering solution and support to Operation and R&D; division in the organisation\nthrough prototyping, equipment efficiency optimization and mass production activities.\nAbout You\nPreferable with experience of using CAD software i.e. Solidworks, Pro-E, AutoCad etc\nFamiliar with Microsoft Office (Word/PowerPoint/Excel)\nKnowledge in Mechanical Design Life Cycle or Engineering process\nKnowledge in Geometrical Dimension & Tolerance and Product Data Management is a plus\nSelf-motivated, independent and a team player with strong analytical skills\nBachelor or Masters student and/or equivalent experience\nAny Requirements: Enter Clean Room etcJob Family: Operations Support\n\n190030 EDE (SG) - Intern (Open)About the Role You will: * Support on CAD Data Migration between old and new server * Support on CAD and BOM Data correction/update * Support on mapping EPDM data to Seascape * Support on Engineering Change"}], "keywords": ["Leadership", "Engineering", "Higher Education", "Software Engineering Intern", "Software Engineering Intern", "Special Project Consultant", "Au Pair and English Tutor", "Math and Science Tutor", "Reconfigurable Computing Lab Research Assistant"]}