{"joblist": [{"link": "https://www.indeed.com.sg/rc/clk?jk=0afd947fe7d3fd9c&fccid=7ae83685be939814&vjs=3", "job_title": "Research Intern", "company": "Xilinx", "location": "Singapore", "summary": "InternshipDescription\nXilinx develops highly flexible and adaptive processing platforms that enable rapid innovation across a variety of technologies - from the endpoint to the edge to the cloud. Xilinx is the inventor of the FPGA, hardware programmable SoCs and the ACAP (Adaptive Compute Acceleration Platform), designed to deliver the most dynamic processor technology in the industry and enable the adaptable, intelligent and connected world of the future in a multitude of markets including Data Center (Compute, Storage and Networking); Wireless/5G and Wired Communications; Automotive/ADAS; Emulation & Prototyping; Aerospace & Defense; Industrial Scientific & Medical, and others. Xilinx's core strengths simultaneously address major industry trends including the explosion of data, heterogeneous computing after Moore's Law, and the dawn of artificial intelligence (AI).\nOur global team is growing and we are looking for bold, collaborative and creative people to help us lead the industry transformation to build an adaptable intelligent world. We believe that by embracing diverse ideas, striving for excellence in all that we do, and working together as a unified team, we can accomplish anything. Come do your best work and live your best life as part of the ONEXILINX team!\n\nXilinx Labs, part of the CTO Office at Xilinx, is concerned with innovation, differentiation, and the de-risking of technology. Goals are to: enable new users; provide a ‘more than Moore’ roadmap; seed new market opportunities; and win the mindshare of startup and research communities. Xilinx Labs has established a new group at the Xilinx Asia-Pacific headquarters in Singapore, to complement its existing groups at the Xilinx headquarters in North America and in Europe.\nThe research intern will participate in projects that span hardware, software, and applications, using a variety of languages, methodologies, and tools. The technical focus is on data center (both communication aspects like software-defined networking, and computation aspects like blockchain). It is expected that the research intern will have a background and practical skills that enable contributions within the area.\n\nMaster or Ph.D. student in Computer Engineering, Computer Science, or Electrical Engineering.\n\nProject experience includes one or more of: embedded software and systems; FPGA applications and tools; hardware design; machine learning; networking; and security."}, {"link": "https://www.indeed.com.sg/pagead/clk?mo=r&ad=-6NYlbfkN0CMugugEJy7r35H7gIRIbSOpSs627YEsfBYUjUt94_KOzqmCEUXE7mfmS4JvDMTiqZ069k7-yW_vHoyyEq9PgkufINzxel5oc4yBaYlacmXiMvMxfCIA-wWn8ssLWXVeY2FU4suZsTOWsa1VuqLXz-1ggsEg9K8I2-sWinrKCsrwOWHqH0fWlcZrLjn8iNRQhcuhh_jp0re-FafQqHh3RysrX_OX5WVC_J2mz2r-c01kJTiahCeB6ozgqu8yCtDzekMHRcn5gu_0BJhl-54E9rTDFDbq7Y-h6zkPBx_Eh1jJ96IWVPLyn0__4o-R1AbfJOoXWWJNdLaYLkbSNgAqsUU5uZH6ry3tUTc7j-vHugIl6OHcx9atWkHGYwIrLGzhE8xbfZ_LAlDS61BooA35KCTwynhRMr3dKw2reFyTLURrdT6zf0ePFFY4g35A57jrg-o__zhsaKXGQvpSufwULe_tt4TJVV6_C2ILpWvPlGH8HfK445WERLl5Ksy9QuqvE3AA99QI-mHPK85iWXl7HnRCAIfHEhJu5oS1q7A0utwonohL31AQkJoCXFl1hsvC2wOpnh-d3RH6vxPwZ1S9Wb8Qs8W6l9SGpvsL6IUM9Ih4ns9jSmU6x0-RuFIxH5rl2KUMSAE7-UYSUzp7Ux-9Jv6QlA_cO-sxK77RPQUPi-zERLcDe9Mn98Aw_Z9C__SMjU5vG-GqjFNoaSbrz5i8HMw&vjs=3&p=1&sk=&fvj=0", "job_title": "EDE (SG) - Intern", "company": "Seagate Singapore International Headquarter Pte Ltd", "location": "Singapore", "summary": "Internship190030 EDE (SG) - Intern (Open)\n\nAbout the Role You will:\nSupport on CAD Data Migration between old and new server\nSupport on CAD and BOM Data correction/update\nSupport on mapping EPDM data to Seascape\nSupport on Engineering Change Order process\nAbout Our Group\nEDE provides total engineering solution and support to Operation and R&D; division in the organisation\nthrough prototyping, equipment efficiency optimization and mass production activities.\nAbout You\nPreferable with experience of using CAD software i.e. Solidworks, Pro-E, AutoCad etc\nFamiliar with Microsoft Office (Word/PowerPoint/Excel)\nKnowledge in Mechanical Design Life Cycle or Engineering process\nKnowledge in Geometrical Dimension & Tolerance and Product Data Management is a plus\nSelf-motivated, independent and a team player with strong analytical skills\nBachelor or Masters student and/or equivalent experience\nAny Requirements: Enter Clean Room etcJob Family: Operations Support\n\n190030 EDE (SG) - Intern (Open)About the Role You will: * Support on CAD Data Migration between old and new server * Support on CAD and BOM Data correction/update * Support on mapping EPDM data to Seascape * Support on Engineering Change"}, {"link": "https://www.indeed.com.sg/pagead/clk?mo=r&ad=-6NYlbfkN0DYMfLfoFj-9YozRFPT8dRMBOLkfFp4TkB_D6gWpE86tbscQ8bPa1u_o2XU6dtu5Az3l79x9v1HqFUGyB8IbIZlEksut_9pjjPJQsq1Lua77TgfJt33panxvyT1pS4zjHNjWZyelRrMaWsQCZu2gS3K_uZRaMtjNqXMt7PKiSLELZVyTKkAz_vp3dcAMiV-M1f6Ob5bK1N7G35BMCp9GsiksENg0_C_gWhLEsDQ-JaWBW3HnrRtQl0zVIHVWm_sojey45K9Yi6mjRl3hdtU3rbDUEoh7_L8JSwXxcufsRQez_7JIJBbvhH0J5ZhZuKDHqo-Wzp9fxf_bm6qF2xMUsulPYLadTKD5RwGHl9O9XQ9pZyuU8AzgVqP_n2OYykyylNmYr9JZBksN1w9Ev3bcVslIHn2zoSfXXu3UvcUPRIlq8vcciiFiG0G&vjs=3&p=1&sk=&fvj=1", "job_title": ".Net developer (SharePoint)", "company": "Edge Media Consultancy", "location": "Outram", "summary": "$3,000 - $4,000 a monthPart-time, Temporary, ContractResponsibilitiesCreation of the SharePoint solutions/components including SharePoint On-Premises (2010+) and SharePoint Online using a variety of the available approaches prescribed by MicrosoftUnder leadership direction, designs, constructs, tests, implements and optimizes portions of basic systems that enable and support business and engineering functions.Collects detailed user and technical requirements. Works with others to analyze collected requirements, translate into programming solutions, and ensure that identified solutions meet customer needs and expectations.Able to work with Experience Design teams to translate XD wireframes and HTML/CSS into technical solutionsRequirementsDiploma/Degree in Computer Science, Computer Engineering, MIS or related field.Minimum 1 years of experience with .NET development and SharePoint experience.Backend (C#) and Front End (Javascript) coding skills. Knowledge and experience of front-end frameworks and ability to determine correct framework(s) for given scenario.Job Types: Part-time, Temporary, ContractSalary: $3,000.00 to $4,000.00 /month"}, {"link": "https://www.indeed.com.sg/pagead/clk?mo=r&ad=-6NYlbfkN0CEcsyxNx5SsDWJZwZ_BlSCS_m9aVwJ_P-u22hRzm4ci2z_TIg_lBwchMZG2oxC4s9X-Ej0LCnCnN_KJmXalpUjF6OrWO2aYfSYm31asRPKOZHgJuT9vblLd0d7_dFXlDuD3jbfirV0JxdfcvCNzoMMcJUn3lzOE63rH7pquZx-P-Wi6cQwSUOHazStJO-k_Z3O9WQsPxbq__IusnG3N-NERFOegPH8Cq9du5OxUSsD_bH6vSX3Q84yMHLfdmrUvXa0PVd62yW9pLunQv6xl_SjkcDo_vah5O19Pfi7hnBVtWpFYU2deY8ICPYveUDS9RXokA_syBxSAkchwD9ZKsNesDDSjBdhF3mTSEXRkxnFINUseI9NIRjKTJu4Ce-jodtnTCkPdeaPaNUNq_WbE1JjFiWou_WExprqfZEAC96raYkrzUrWyngs-lCc8UkmL1mL_BEwdNL74-kf_HTkfd-W6QW2KG_Yc3ozggVoUufqvSkAIiAIhcTQzgTpTpR_TWTx0rHfM91EWL3hpr7muQV0A3ozJKS4We-g1sev9zbpb4O8mluaBp3qcFhhdoDQ4mY=&vjs=3&p=1&sk=&fvj=0", "job_title": "Software Engineer (Java)", "company": "Apple", "location": "Singapore", "summary": "Summary\nPosted: Oct 17, 2018\nWeekly Hours: 40\nRole Number: 113394790\nWe’re a diverse collection of thinkers and doers, continually reimagining our products, systems, and practices to help people do what they love in new ways. A deeply reciprocal place, where everything we build is the result of people in different roles and teams working together to make each other’s ideas stronger. That same real passion for innovation that goes into our products also applies to our practices, strengthening our commitment to leave the world better than we found it.\nThere is a superb opportunity for a hardworking Java Software Engineer with a consistent record of delivering complex software applications to work as part of a global Software Engineering team.\nKey Qualifications\nExperience in object-oriented programming (Java, J2EE, Spring or other MVC framework)\nDeep understanding and hands on experience in development of Service Oriented Architectures and RESTFUL services using JAX-RS\nUsage of source version control software (e.g. Git)\nFamiliar with Test Driven Development using testing frameworks like Mockito, PowerMock etc.\nKnowledge of a major relational or NoSQL database (e.g. Oracle / Cassandra)\nAn understanding of distributed messaging systems\nKnowledge of data structures, design patterns, architectural styles and API design\nDedication to code quality with experience of automated testing techniques (both static and dynamic)\nEvaluating and defining requirements and problem statements\nDeveloping technical documentation, diagrams & flowcharts\nKnowledge of containerisation of applications using Docker will be an added advantage\nKnowledge of AWS or other cloud technologies is a strong positive\nDescription\nThe role requires an excellent grasp of technical concepts with a proven understanding of the full development life cycle process with a forward thinking mindset, ability and confidence to challenge the status quo.\nEducation & Experience\nBachelors or Masters degree in Computer Science, Mathematics, or relevant industry experience or equivalent is required."}, {"link": "https://www.indeed.com.sg/pagead/clk?mo=r&ad=-6NYlbfkN0D4k3BikGxhXEJZElrbugQFmRH7VXJW0XJPSmFeffvuxd9aGaKwjqZ9mxv1LFTH9aVJPiHzpQW0k59cIxhOKZnpX4G4iqRiXCzX_aSPUNc46tuzWCOTcUZ5d-pajGxfj6-2ngyGN2O6rGoKrEIv7jfsqlogxjrMyPCZ6t-pxVZ0xfGtIX8hstrwIHduPGaVZgajw6GcJ6RaUXaT5wJJAu-jEWiMoJRY7PrykGU9tZgP4jh7La410yq_y_aDo3lkpmfgQDXtOQZAyG1G_w1GsBS0eVLdFRIPFakmuMEniOyhbA4px1TFAWnamcxsqfBE0TzOilst7NLb5Awt8H3CZ6CGEw_8BKiN5p59l5NvMj-ZlYRkIp-NS2RAUZQM3zeGR8Xwg5FIO_nF_NGCxa96ZLPbh8cmpapan5Rc9RB2pS2c_w==&vjs=3&p=1&sk=&fvj=1", "job_title": "Ballet -Teaching & Teaching Assistant Positions", "company": "Petit Ballerinas (Singapore) Pte. Ltd.", "location": "Serangoon", "summary": "$1,500 - $2,500 a monthPart-timeTeaching and or Assistant Teaching - Royal Academy of Dancing Syllabus to Pre-Primary and Primary Levels (4-6 years old).Teaching and or Assistant Teaching - Melody Bear Syllabus - Little Bear Feet and Melody Movement (2 - 4 years old).Melody Bear is new to Singapore and we are one of the very few schools to teach this syllabus out of the UK. You would be instructed and trained under our very own Principal Yolande who has had 30 years experience teaching Ballet and worked in Early Childhood running her own Kindergarten. Yolande will be able to give her own personal time to you to teach you how to work with the younger children.This is a great opportunity if you are a Graduate out of any of the Dance Colleges and not had any experience in dance teaching or only had very little dance teaching experience. We will also be very pleased for applicants with lots of dance teaching experience to contact us to refine their skills.Even if you have not completed a dance degree, we will be interested in you.*Applicants will need to have had some form of dance training to apply.We hold Annual Assessment for students, Parent Watching Days, Motivational Awards and Annual Concert.You will be involved in all of the above events throughout the year.Job Type: Part-timeSalary: $1,500.00 to $2,500.00 /monthExperience:dance training: 8 years (Preferred)"}, {"link": "https://www.indeed.com.sg/pagead/clk?mo=r&ad=-6NYlbfkN0DNq5tWNE6YHxB57X78nvD9QpWPOCxC4Wwa9bAdU9oUKA6Zgc9WRdhc1WDHIVOd-x9XWPUaz2y6TX6Ed7SO7n5DCzWOVP6GlJjSKFhdTHsdbLqANr4Wcz33-o5n_ufcWH2zn-IJyo-5aP5B5qcVyknHuuSiCo_re4j_8r_uvLdza83qKLEv3S-WMjhEzJukH-3Ky7hBt1Lmgpv2X6yH2XmQuJE5ripwKs3CgQNfV2pLfbH8Vg3HTeVPLwyrTnXMvld4G0fH_yAmzPoURZ7yR68oqoJW0C482wq4iNjPMjd-EgulVW0aEDhwMyUWQUEnLeiJ-Z6o297bXyCedw6hug3V4kC7A2MENJt0sg5USgVQDsQ7-vFLTOqulVXvSoIhr4hxYBeTdAfihDJ1H39mwLai4JfYqBkXWZ9e3BBRzH01_yI_Fevn-vMpdzX4MIakk4I=&vjs=3&p=1&sk=&fvj=1", "job_title": "Project Co-ordinator", "company": "Sensorflow Pte Ltd", "location": "Singapore", "summary": "$2,200 - $3,000 a monthResponsibilitiesShould be able to interpret building mechanical system plan, perform inspection of ACMV and Electrical systemShould be able to replace air-conditioning thermostat and supervise components replacement.Should be able to understand chilled water centralized system ,VRV system and Split Unit systemShould able to interpret the various types of control systems linked to Building Management System (BMS)Should be able to conduct on-site energy audit using appropriate measuring instruments and tools, and recommend corrective measures for energy savings.Should be able to apply the fundamentals of computer networking, set up and configure wired and wireless local area network (LAN) including IP address.Should be able to prepare installation report using apply Word, Excel and PowerPoint.Assist project manager in project preparation & ImplementationOther Ad- hor duties as assignedPreferred QualificationsHigher Nitec in Facility Management2 to 3 years experience in building maintenance coordinationLiterate in Microsoft office(Excel, Words& Power Point)Job Type: Full-timeSalary: $2,200.00 to $3,000.00 /monthExperience:air-con industry: 1 year (Preferred)building maintenance coordination: 3 years (Preferred)"}], "keywords": ["Java", "Microsoft Office", "JavaScript", "Machine Learning Research Intern", "Software Development Intern (AutoCAD Windows Mobile)", "Teaching Assistant", "Software Engineering Intern"]}