{"joblist": [{"link": "https://www.indeed.com.sg/rc/clk?jk=882efa7a7fcf4ab7&fccid=182a2609b8af918e&vjs=3", "job_title": "Graduate Business Intern/Associate", "company": "Refinitiv", "location": "Singapore", "summary": "InternshipJob Description\nRefinitiv Labs provides a unique opportunity to work in a global team tasked with validating new business opportunities in Financial Services that leverage our data and emerging technologies.\n\nRole Summary:\nRefinitiv Labs is looking for an exceptional person to develop and extend our market landscaping and engagement with our primary external stakeholders – and work across the Applied Innovation team to ensure we develop digitally informed ways of identifying new opportunities, operating and executing measurable best practices.\n\nWhile the Labs team executes on the actual innovation projects, you will be at the heart of the Enablement team that drives our market landscaping and defines, implements and controls a cohesive operating model to underpin activities across Refinitiv Labs in Singapore, and across diverse subject matter experts within the group, which comprises UX, User Interface (UI), Design Thinking, and full stack Data Science, Dev and Engineering expertise.\n\nMajor Responsibilities / Accountabilities:\n\nCarries out complex market landscaping, opportunity sizing, research and analysis on a stand-alone basis as part of their workstream\nTakes thought leadership role in problem solving and developing practical recommendations\nTakes the results to a logical and relevant end product, with minimum supervision\nCreates deliverables, including reports, newsletters, spreadsheets, presentations and other outputs to document and communicate findings\nCommunicates findings externally and internally\nIndependently interacts and collaborates with mid and senior-level stakeholders\nLeads customer insight discussions\nDevelops materials and execution plans for key/regular customer engagements\nBecomes “expert” on specific emerging tech and business areas\nMay manage junior staff on workstream\n\nTechnical /Professional Skills & Competencies:\n\nEssential Skills & Experience Required:\n\nStrong analytical, quantitive and fact finding skills in order to size new opportunities\nCurious and passionate about innovating and identifying new opportunities\nExcellent relationship building and communication skills, both written and verbal\nSelf-starter\n\nDesired Skills:\n\nBroad business acumen for customer and partner engagements\nMeeting deadlines and multi-tasking\nStructured approach to work to enable complex planning\n\nEducation/ Certifications:\n\nBachelor degree\nMBA an advantage, but not essential\nThe Financial and Risk Business of Thomson Reuters is now Refinitiv. Refinitiv equips the financial community with access to an open platform that uncovers opportunity and catalyzes change. With a dynamic combination of data, insights, technology, and news from Reuters, our customers can access solutions for every challenge, including a breadth of applications, tools, and content—all supported by human expertise. At Refinitiv, we facilitate the connections that propel people and organizations to find new possibilities to move forward.\n\nAs a global business, we rely on diversity of culture and thought to deliver on our goals. Therefore we seek talented, qualified employees in all our operations around the world regardless of race, color, sex/gender, including pregnancy, gender identity and expression, national origin, religion, sexual orientation, disability, age, marital status, citizen status, veteran status, or any other protected classification under country or local law. Refinitiv is proud to be an Equal Employment Opportunity/Affirmative Action Employer providing a drug-free workplace.\nIntrigued by a challenge as large and fascinating as the world itself? Come join us.\nLocations\nSingapore-Singapore"}, {"link": "https://www.indeed.com.sg/rc/clk?jk=0e17e3da0e66ba3d&fccid=afda98bfc8224b19&vjs=3", "job_title": "Regional Talent Acquisition Intern - Sephora South East Asia", "company": "Sephora SEA", "location": "Singapore", "summary": "InternshipContext\nSephora, a division of LVMH – Moët Hennessy Louis Vuitton global luxury leader, is a global leader in beauty retailing. It successfully operates more than three thousand points of sale across Americas, Europe, Middle East and Asia. Its aim is to animate the most loved beauty community in the world.\nSephora South East Asia is a high growth division of leading global beauty retailer, Sephora. Our teams run omni-channel retail businesses in Singapore, Thailand, Australia and Malaysia, franchise operations in India & Indonesia and we run ecommerce only businesses (the first in the world globally for Sephora!) in Philippines, Hong Kong and New Zealand. Our success is built on innovation, a unique product portfolio, market leading digital capability, and our exceptional people! With ambitious growth plans, we are always looking for talented people who are passionate about building businesses and developing themselves and our customers’ experience.\nRegional Talent Acquisition Intern, Sephora South East Asia\nThis is an exciting opportunity for an individual who is looking or exploring HR functions, especially in the field of Talent Acquisition. The Regional Talent Acquisition Intern will be part of the Talent Acquisition team, which focuses on delivering solutions and assistance related to hiring efficiency & employer branding. You can expect to gain practical skills under the mentorship of committed and experienced leaders, and the invaluable experience of working in a dynamic and fast-paced environment.\nJob Responsibilities\nThe Regional Talent Acquisition Intern will get to work alongside with the Regional HR team as well as interact with internal stakeholders and employees across all levels and departments. You will be responsible to support day-to-day HR related duties as well as projects in relations to Talent Acquisition.\n1. Drive end-to-end Talent Acquisition activities\nCraft job descriptions, post jobs on job portals, phone screen candidates, arrange and conduct interviews, execute reference checks and draft offer letters\nReview and optimize talent acquisition processes across different country HR teams – Singapore, Malaysia, Thailand, Australia and Indonesia\nBuilding and maintaining seamless interview processes to ensure great candidate and hiring manager experience\nWorking closely with hiring managers to prioritise hiring needs\n2. Open positions reporting and build a strong pipeline of talents\nConsolidate open positon reports from Singapore, Malaysia, Thailand, Australia and Indonesia\nMaintaining data reports and performance metrics to drive improvements\n3. Employer branding initiatives\nCreate content, messages and collateral for social media channels (e.g. LinkedIn) to enhance recruitment and employer brand image\nEnsure content are effectively deployed across social media channels in a timely manner\nResearch interview tools and metrics to increase hiring efficiency\nSupport other functions in crafting employee communication content\nRequirements\nThe Regional Talent Acquisition Intern will demonstrate strong problem solving and critical thinking skills. He/She should have excellent organization and efficient time management skills to thrive in a deadline-driven environment.\nUndergraduates or graduates specializing in Human Resource, Business, Marketing or related fields\nA passion for delivering exceptional candidate experience\nHigh initiative, self-driven and a good team player\nFlexible to quickly adjust and respond to changing requirements\nProcess oriented, detailed and meticulous\nExcellent English skills - verbal and written proficiency\nStrong knowledge of MS Office, including Word, Excel and Power Point"}, {"link": "https://www.indeed.com.sg/rc/clk?jk=42eb4bd6f6e7c2ed&fccid=9fcec0cadb071602&vjs=3", "job_title": "Interaction Designer", "company": "Edenspiekermann", "location": "Singapore", "summary": "Job description\nEdenspiekermann Singapore is looking for an Interaction Designer who can help us translate user-goals and brand identity into outstanding digital experiences. Someone who is able to work on complex projects (https://www.edenspiekermann.com/projects/arthit/) willing to dive deep into a world (https://www.edenspiekermann.com/magazine/the-fastest-way-from-q-to-a/) you didn't even know existed. You're also someone that easily switches to smaller projects, working on UI design and front-end coding. We're hoping to find someone who can do both!\n\nYou happened to be one of the best of your class when you graduated. This shows in your portfolio, which consists of interaction design cases for digital products and online services. We're hoping to see some experimental or unexpected work as well. That way we can get acquainted with your creative and original mind!\n\nWhat we offer\nAn active and involved role in our small but growing digital design team\nA mentor to challenge and guide you so we can all benefit from your skills\nA loft-like work location in the lively Joo Chiat heritage neighbourhood of Singapore\nA salary in line with market conditions\nMax. 8 hour working days\nWhat we hope to find in you\nYou're a nice person to be around, communicative and open-minded\nYou love to conceptualise and craft digital products that support user behaviour and work across all devices\nSketch has no secrets for you; you also love to get your hands dirty with recent UI and coding tools like Figma or Framer\nYou understand and have worked with media queries for responsive websites\nYou have a keen interest in building awesome experiences with transitions and animations in HTML and CSS. Knowledge of JavaScript is a bonus.\nYou know how to build modular, scalable components that can be used anywhere on a larger website\nYou must know Github and the Git workflow (who doesn't, anyway).\n\nMost importantly, you have a passion for learning new things and building cool shit. If most of these statements make sense to you, we'd love to get in touch with you. You need to be fluent in English, and you must be available and able to work in Singapore.\nInterested?\nWe look forward to your application!"}, {"link": "https://www.indeed.com.sg/rc/clk?jk=1edc8b7250ce84b0&fccid=90c8fe3e6cff6c50&vjs=3", "job_title": "Graphic Designer - Asia", "company": "ENTERTAINER FZ LLC", "location": "Singapore", "summary": "Us\n\nThe ENTERTAINER is a leading digital company whose main goal is to add value to consumers by bringing them the best incentive offers globally. We are a data-driven, 100% digital, tech company. Providing first-rate offers across renowned dining, leisure, entertainment and hotel brands worldwide, the ENTERTAINER has grown with the aim of creating unbeatable value and loyalty everywhere we go.\nWe believe that “experience is everything”, resulting in our passion for creating unforgettable experiences for both our customers, partners and employees.\nThe Team\nIn just less than a decade, The Asia Team was built from the ground up to what it is now: a solid group of highly-skilled and driven individuals responsible for making Asia one of the largest ENTERTAINER regions across the world. From Sales, to Marketing, to Content, to HR, our team’s goal is to deliver the best product year after year and provide valuable experiences that bring smiles to our members. You’ll currently find us in Singapore, Malaysia, Hong Kong, and Bali but our eyes are also set on expanding to neighbouring locations. So don’t be surprised if you’ll see us in your city soon. Because we are already looking forward to see you.\nThe Graphic Designer will…\nBe responsible for creating designs for banners, e-mailers, Social media campaigns,\nsites, print, OOH, (APP UI and UX experience a plus)\nNeed to be able to share local insight and work with the Global team on local trends.\nBrainstorm with teams in other countries and be able to work independently\n\nYou’ll enjoy and succeed in this job if….\nStrong creative vision and visual arts skills with an established portfolio\nof print and digital marketing collateral\nUI experience\nFlexibility to work last minute overtime as needed\nIf you are an amazing designer!\n\nExperience required\nAgency experience a must\nHave experience designing, banners, e-mailers, site, print, OOH, ( UX and UI a plus)\nAn established portfolio\nAbility to partner with different teams and departments within the organization\nAdobe Photoshop, InDesign, Sketch, all CSS3 Skills\nExcellent verbal/ written communication skills\nGIF Animation Skills\nSalesforce knowledge advantageous but not required"}, {"link": "https://www.indeed.com.sg/pagead/clk?mo=r&ad=-6NYlbfkN0BaPp38t20B8eBR1eUUxGBgPftS685gzY1WJUba2a5u2tLj7uQVSvnURylbdRz_xb_RcvkXQM3kZgLznZbixzttV31OveYW9LRqCSV0HvoKRMcQtXQm0xnYH1S-HwPhoGZxLVr3F1HOJ2JOojwQKbLGRPqZBk4hYbLHJObw0hp7IKkvmIqQ-HlzV8hGOjg8OlW5-IP83TJI1Z5k_T31Bh0JdpkimaLEIT4RulULBeOviWlvChtdndNMsdwGTau1OHZIlu2qwGF446jXeMu_CVkNUtt5f_-vYLDfXOC2lo-o0O7vjqY7JoKQ8R7Y1dwr4fxQiz-aQeqCpnVgJXxbtfv2ANxWRU5ABUdLxWk65YHWKFi_pkGRcC3ZTm4cWoLnGGxLctpRLac1Atp3qopldL7usmmOMGSr7h8ih5lM30MaU74x8wYf8DVxb2lK_uVdbCCPFzg9VOLf5v1jGpTjazdRyhoj6nz7FT89NfbzMgQHQw==&vjs=3&p=1&sk=&fvj=0", "job_title": "PROJECT DIRECTOR (TOKYO)", "company": "Amida Recruit", "location": "Singapore", "summary": "PermanentA leading project and construction advisory firm is now seeking a Project Director to lead a Greenfield Data Centre project in Tokyo, Japan. This is a highly challenging and exciting opportunity to work with a global client on a multi million project.\n\nAs a Project Director, you will provide strategic advice to the Client at the project conception stage, including delivery model, procurement strategy, selection of main contractors and contract negotiations. You will be adopting project management methodologies in order to successfully achieve client's objectives which includes time, cost and quality parameters. You will establish effective project governance, processes, templates and systems to be utilized throughout the project. You will take a lead position in interacting with the client and other consultants at all project stages.\nThe ideal candidate should meet the following requirements,\n\nRecognised Degree in Engineering (Civil, Mechanical or Electrical).\nA minimum of 20 years working experience in Japan with a successful track record of delivering projects in data centres or hi tech sectors.\nLeadership position for the past 5 years.\nStrong ability to manage clients, contractors and other vendors; a mix of consultancy and contractor experience will be highly advantageous.\nCandidates with the ability to work independently in a diverse working environment will be highly sought after.\nRole is based full time in Tokyo, Japan.\nCandidates have to be effectively bilingual in both English and Japanese as the role requires communicating and managing stakeholders in both languages.\nDon't miss out on this exciting opportunity today. Send your CV to Cheryl.lee@amida-recruit.com\n\nEA No. 14C6959\n\nReg No. R1219598\nReference Number: CLE351_154754639367170\n\nConsultant: Cheryl Lee\nEmail: property.asia@amida-recruit.com\nPhone: +65 6922 0620\nEA: R 1219598"}], "keywords": ["Sketch App", "Leadership", "Figma", "UX Design Intern", "People Operations Intern"]}